Autodesk.Revit.DB.Electrical.Wire.GetVertex(System.Int32)
Gets the position of an existing vertex.
index:
The index of the existing vertex. Should be between 0 and Autodesk.Revit.DB.Electrical.Wire.NumberOfVertices.
Returns:
The position of the vertex.
It is the offset point for the start and end vertex, not the connector point.
If the wire connects to one device, it may have offset; otherwise, the start and end vertex is same as the connector point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index should be between 0 and the number of vertices of the wire.
Since:
2015

Autodesk.Revit.DB.Electrical.Wire.SetVertex(System.Int32,Autodesk.Revit.DB.XYZ)
Sets the position of a given vertex.
If the vertex is start or end point, and the wire connects to electrical device, the wire end offset will be set according to the given vertex.
If the vertex is start or end point, and the wire connects to other wire, user can't set the vertex and exception will be thrown.
If the vertex is start or end point, and the wire connects to nothing, the vertex will be set as the given vertex.
index:
The index of the existing vertex. Should be between 0 and Autodesk.Revit.DB.Electrical.Wire.NumberOfVertices.
vertexPoint:
The new position for the vertex.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index should be between 0 and the number of vertices of the wire.
-or-
The vertex point cannot be added to the wire because there is already a vertex at this position on the view plane (within tolerance).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can't set the vertex when the vertex is start or end point and the wire connects to other wire.
Since:
2015

Autodesk.Revit.DB.Electrical.Wire.RemoveVertex(System.Int32)
Removes the vertex corresponding to the specified index.
Can not remove the start or end vertex if it already connects to other element.
index:
The index which should be in [0, NumberOfVertices).
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index should be between 0 and the number of vertices of the wire.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The wire has only 2 vertices, so one cannot be removed.
-or-
Can't remove the vertex when the vertex is start or end point and the wire connects to one element.
Since:
2015

Autodesk.Revit.DB.Electrical.Wire.InsertVertex(System.Int32,Autodesk.Revit.DB.XYZ)
Inserts a new vertex before the specified index.
Remarks:
To add a new vertex to the end of the wire, use Autodesk.Revit.DB.Electrical.Wire.AppendVertex(Autodesk.Revit.DB.XYZ).
index:
The index of the vertex to come after this new vertex. Should be between 0 and Autodesk.Revit.DB.Electrical.Wire.NumberOfVertices.
vertexPoint:
The point of the new vertex.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index should be between 0 and the number of vertices of the wire.
-or-
The vertex point cannot be added to the wire because there is already a vertex at this position on the view plane (within tolerance).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can't insert the vertex before the start vertex if the start point connects to one element.
Since:
2015

Autodesk.Revit.DB.Electrical.Wire.AppendVertex(Autodesk.Revit.DB.XYZ)
Appends one vertex to the end of the wire.
vertexPoint:
The vertex to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The vertex point cannot be added to the wire because there is already a vertex at this position on the view plane (within tolerance).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The end point is already connected to an element, so a new endpoint vertex cannot be appended.
Since:
2015

Autodesk.Revit.DB.Electrical.Wire.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Electrical.WiringType,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Creates a new wire.
document:
The document.
wireTypeId:
The id of the wire type of the newly created wire.
viewId:
The view in which the wire is to be visible. This must be the id of a floor plan or reflected ceiling plan view.
wiringType:
Specifiies the wiring type for the newly created wire. The shape of the wire is determined by this value and the total number of points supplied via the vertexPoints and endpoint connectors. If the wiring type is WiringType.Arc:
If there are 2 total points supplied, the wire is a straight-line wire.If there are 3 total points supplied, the wire is a circular arc wire.If there are 4 or more points, the wire is a spline wire.
If the wiring type is WiringType.Chamfer, a polyline wire will be created connecting all the points.
vertexPoints:
The vertex point of the wire.
If the startConnectorTo is null, the first vertex of the vertexPoints will be the start point, otherwise, the start connector origin will be the start point.
If the endConnectorTo is null, the last vertex of the vertexPoints will be the end point, otherwise, the end connector origin will be the end point.
startConnectorTo:
The connector to which the wire start point connects. If null, the start point connects to no existing connector. If set with a connector, the connector's origin will be added to the wire's vertices as the start point.
endConnectorTo:
The connector to which the wire end point connects. If null, the end point connects to no existing connector. If set with a connector, the connector's origin will be added to the wire's vertices as the end point.
Returns:
The wire created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
wireTypeId is not a valid WireType id.
-or-
viewId does not represent a view valid for a Wire element. Either a floor plan or reflected ceiling plan is expected.
-or-
vertexPoints is not valid, because one or more points are coincident by comparing the X and Y of the points, or there are not at least two points including the connectors.
-or-
startConnectorTo cannot be connected to a wire, as it is not an electrical connector.
-or-
endConnectorTo cannot be connected to a wire, as it is not an electrical connector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015